Repository: Nura1i/recipe_app_2
Catalog: lib/l10n/app_*.arb
Languages: uz

source: Next
uz: Keyingi

source: Back
uz: Orqaga

source: Done
uz: Bajarildi

# personn
source: Person
uz: Kishi

source: SIGN UP
uz: Ro'yxatdan o'tish

source: SIGN IN
uz: Tizimga kirish

source: Forward
uz: Oldinga

source: Enter your name...
uz: Ismingizni kiriting...

source: Enter email...
uz: Elektron pochtani kiriting...

source: Enter a password...
uz: Parol kiriting...

source: Select language
uz: Tilni tanlang

source: Personal Information
uz: Shaxsiy Malumot

# nameHint
source: Enter your name
uz: Ismingizni kiriting

source: Hello
uz: Salom

# findrecipe
source: Find best recipes for cooking!
uz: Ovqat pishirish uchun eng yaxshi retseptlarni toping!

# milliytaom
source: Uzbek National Recipes🔥
uz: Uzbek Milliy Taom🔥

source: Popular Shef
uz: Mashhur oshpazlar

source: Recent Added
uz: Oxirgi qo'shilgan

source: Recent Added Recipes
uz: Oxirgi qo'shilgan retseptlar

source: Settings
uz: Sozlamalar

source: Recipes
uz: Retseptlar

source: Saved Recipes
uz: Saqlangan Retseptlar

source: Saved
uz: Saqlangan

source: Likes
uz: Layklar

source: Recipe
uz: Retsept

source: All
uz: Hammasi

source: Unread
uz: O'qilmagan

source: Read
uz: O'qing

source: Theme
uz: Mavzu

source: Light
uz: Nur

source: Dark
uz: Qorong'i

source: Log Out
uz: Chiqish

source: Language
uz: Til

source: See all
uz: Hammasini ko'rish

source: Create recipe
uz: Retsept yaratish

source: Trending Now🔥
uz: Hozir trendda🔥

source: Notifications
uz: Bildirishnomalar

# search
source: Search recipes...
uz: Retseptlarni qidirish...

source: Search Users
uz: Foydalanuvchilarni qidirish

source: Popular category
uz: Ommabop kategoriya

source: Recipe Category
uz: Retseptlar Categoriyasi

source: Image is empty
uz: Rasm bo'sh

source: Main text is empty
uz: Asosiy matn bo'sh

source: Time is empty
uz: Vaqt bo'sh

source: Serves is empty
uz: Xizmatlar bo'sh

source: BodyText is empty
uz: Asosiy matn bo'sh

source: Main text...
uz: Asosiy matn...

source: Serves
uz: Xizmat qiladi

source: Cook Time
uz: Pishirish vaqti

source: Body text...
uz: Tana matni...

source: Ingredients
uz: Ingredientlar

source: Add new Ingredient
uz: Yangi ingredient qo'shing

source: Quantity
uz: Miqdori

source: Item name...
uz: Element nomi...

source: Accept
uz: Qabul qiling

# time
source: Cook Time :
uz: Vaqti :

# kishilik
source: Person
uz: Kishiga

source: Cancel
uz: Bekor qilish

source: Yes
uz: Ha

source: Edit profile
uz: Profilni Tahrirlash

source: Delete Post
uz: Postni o'chirish

# deletePost2
source: Do you want to delete Post?
uz: Postni o'chirib tashlamoqchimisiz?

source: Your Profile Image Delete
uz: Profil rasmingizni o'chirish

source: Your Profile Image empty
uz: Profil rasmingiz bo'sh

source: Sign Out
uz: Tizimdan chiqish

source: User Name
uz: Foydalanuvchi Nomi

source: Email
uz: Elektron Pochta

source: User Name Is Empty
uz: Foydalanuvchi nomi bo'sh

source: Email Is Empty
uz: Elektron pochta bo'sh

source: Bad Format Email
uz: Noto'g'ri formatli elektron pochta

source: Password Is Empty
uz: Parol bo'sh

source: Password must be more than 6 !
uz: Parol 6 tadan ko'p bo'lishi kerak !

# theEmailAddressIsAlreadyInUseByAnotherAccount
source: Email address is already in use by another account
uz: Bunday Elektron pochta manzili bor

# allreadyhasaccount
source: Already have an account
uz: Akauntingiz bormi

source: Create new Account
uz: Yangi Accaunt yaratish

source: There is no user record corresponding to this identifier. The user may have been deleted.
uz: Ushbu identifikatorga mos keladigan foydalanuvchi yozuvi yo'q. Foydalanuvchi o'chirilgan bo'lishi mumkin.

source: Do you want to exit the Application ?
uz: Siz Ilovadan chiqib ketishni hoxlaysizmi ?

# introPage1
source: Hello! Welcome to our ''Cooking'' app!
uz: Assalomu Aleykum! ''Cooking'' ilovamizga xush kelibsiz!

# introPage11
source: We are very happy to see you in our Cooking app! Click «Next» to get familiar with our application!
uz: Sizni Cooking ilovamizda ko'rganimizdan juda xursandmiz! Bizning ilovamiz bilan tanishish uchun «Keyingi» tugmachasini bosing!

# introPage2
source: Are you interested in cooking? But you can't?
uz: Siz pazandalikka qiziqasizmi? Lekin sizning qo'lingizdan kelmayaptimi?

# introPage22
source: Then our Cooking app can help you! Learn to cook with us! And share with your loved ones.
uz: Unday bo'lsa bizning ''Cooking'' - ilovamiz sizga bu borada yordam bera oladi! Biz bilan birga pazandalikni o'rganing! Va yaqinlaringizga xam ulashing.

# introPage3
source: In our Cooking app, you can share your recipes with others!
uz: ''Cooking'' - ilovamizda siz o'zgalargaxam o'z retseplaringizni ulasha olasiz!

# introPage33
source: Share your recipes with the world! and surprise your loved ones with your recipes!
uz: Siz o'zingiz tuzgan retseplaringizni Dunyoga mashxur qiling! va yaqinlaringizni o'z retseplaringiz bilan hayron qoldiring!.
